config.org
#+PROPERTY: header-args :tangle yes :results none
#+STARTUP: overview

* init
#+begin_src emacs-lisp
;;;;; SETTINGS ;;;;;
(setq! doom-theme 'doom-dracula
       ;; dracula-enlarge-headings nil
       blink-matching-paren t
       markdown-hide-urls t
       eldoc-idle-delay 100
       windmove-wrap-around t
       confirm-kill-emacs nil
       ispell-dictionary "en"
       auto-revert-verbose nil
       user-full-name "mr big"
       doom-localleader-key "m"
       register-preview-delay 2
       text-scale-mode-step 1.06
       use-package-always-defer t
       kill-whole-line t
       large-file-warning-threshold (* (expt 10 6) ;; generate um megabyte
                                       20) ;; make it 20 megabytes
       display-line-numbers-type nil
       ;; pabbrev-idle-timer-verbose nil
       user-mail-address "mrbig033@protonmail.com"
       bookmark-default-file "~/.doom.d/lisp/bookmarks"
       flycheck-global-modes '(not emacs-lisp-mode lisp-interaction-mode)
       header-line-format "  " ;; source: https://bit.ly/2tdnkkh
       ;; doom-scratch-initial-major-mode 'my-lisp-interaction-mode
       bitly-access-token "3026d7e8b1a0f89da10740c69fd77b4b3293151e"
       doom-variable-pitch-font (font-spec :family "sans" :size 28)
       persp-emacsclient-init-frame-behaviour-override nil
       doom-font (font-spec :family "monospace" :size 27 :weight 'semi-light))

(setq-default fill-column 100)

(add-to-list 'display-buffer-alist
             '("*info*" display-buffer-same-window))
(put 'customize-group 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'scroll-left 'disabled nil)

(load-file "~/.doom.d/lisp/cool-moves/cool-moves.el")
(global-hl-line-mode -1)

(global-evil-visualstar-mode t)
(mouse-avoidance-mode 'banish)
(global-auto-revert-mode t)
(global-subword-mode t)
(global-eldoc-mode nil)
(size-indication-mode -1)
(line-number-mode -1)
(setq column-number-mode nil)
(setq-default column-number-mode nil)
(column-number-mode -1)
(setq-default line-number-mode nil)
(setq-default global-eldoc-mode nil)
(set-popup-rule! "tmp.el" :side 'bottom :modeline t :height 19 :quit 't)
#+end_src
* hooks
#+begin_src emacs-lisp
;;;; REMOVE HOOKS ;;;;;
(remove-hook! '(org-mode-hook
                text-mode-hook
                ;; prog-mode-hook
                ) hl-line-mode)
(remove-hook 'find-file-hooks 'global-eldoc-mode-check-buffers)
(remove-hook 'doom-first-buffer-hook #'global-hl-line-mode)

(remove-hook! 'evil-visual-state-exit-hook 'doom-enable-hl-line-maybe-h)

;;;; ADD HOOKS ;;;;;
(add-hook 'picture-mode-hook 'evil-emacs-state)
(add-hook 'pdf-outline-buffer-mode-hook (lambda ()
                                          (let ((inhibit-message t))
                                            (toggle-truncate-lines nil))))

(add-hook 'git-timemachine-mode-hook (lambda () (olivetti-mode 1)))

(add-hook! 'markdown-mode-hook
           #'electric-pair-mode)

(add-hook! '(text-mode-hook
             org-mode-hook
             markdown-mode-hook)
           #'electric-operator-mode
           #'abbrev-mode)

;; (add-hook! '(prog-mode-hook
;;              org-mode-hook) #'yas-minor-mode-on)

(add-hook 'prog-mode-hook #'hl-line-mode)

(add-hook! '(prog-mode-hook
             text-mode-hook
             org-mode-hook
             helpful-mode-hook
             conf-mode-hook) #'olivetti-mode)

;;;; MAKE SCRIPTS EXECUTABLE ;;;;;
;; source: https://bit.ly/31ZDduV
(add-hook 'after-save-hook
          'executable-make-buffer-file-executable-if-script-p)
#+end_src
* functions
** text
#+begin_src emacs-lisp
(defun my-deer-find-tmp ()
  (interactive)
  (deer "~/.doom.d/tmp/"))

(defun my-comment-line ()
  (interactive)
  (save-excursion
    (comment-line 1)))

(defun my-indent-buffer-save-excursion ()
  (interactive)
  (save-excursion
    (let ((inhibit-message t))
      (evil-indent
       (point-min)
       (point-max)))))

(defun my-indent-buffer ()
  (interactive)
  (let ((inhibit-message t))
    (evil-indent
     (point-min)
     (point-max))))

(defun my-backward-kill-line (arg)
  "Kill ARG lines backward."
  (interactive "p")
  (kill-line (- 1 arg)))

(defun my-sort-lines-by-length (reverse beg end)
  "sort lines by length."
  (interactive "p\nr")
  (save-excursion
    (save-restriction
      (narrow-to-region beg end)
      (goto-char (point-min))
      (let ;; to make `end-of-line' and etc. to ignore fields.
          ((inhibit-field-text-motion t))
        (sort-subr reverse 'forward-line 'end-of-line nil nil
                   (lambda (l1 l2)
                     (apply #'< (mapcar (lambda (range) (- (cdr range) (car range)))
                                        (list l1 l2)))))
        (reverse-region beg end)))))

(defun endless/simple-get-word ()
  (car-safe (save-excursion (ispell-get-word nil))))

(defun endless/ispell-word-then-abbrev (p)
  "Call `ispell-word', then create an abbrev for it.
      With prefix P, create local abbrev. Otherwise it will
      be global.
      If there's nothing wrong with the word at point, keep
      looking for a typo until the beginning of buffer. You can
      skip typos you don't want to fix with `SPC', and you can
      abort completely with `C-g'."
  (interactive "P")
  (let (bef aft)
    (save-excursion
      (while (if (setq bef (endless/simple-get-word))
                 ;; Word was corrected or used quit.
                 (if (ispell-word nil 'quiet)
                     nil ; End the loop.
                   ;; Also end if we reach `bob'.
                   (not (bobp)))
               ;; If there's no word at point, keep looking
               ;; until `bob'.
               (not (bobp)))
        (backward-word)
        (backward-char))
      (setq aft (endless/simple-get-word)))
    (if (and aft bef (not (equal aft bef)))
        (let ((aft (downcase aft))
              (bef (downcase bef)))
          (define-abbrev
            (if p local-abbrev-table global-abbrev-table)
            bef aft)
          (message "\"%s\" now expands to \"%s\" %sally"
                   bef aft (if p "loc" "glob")))
      (user-error "No typo at or before point"))))

(defun my-search-settings ()
  (interactive)
  (counsel-ag nil "~/.doom.d/" "-f -G 'config.org'"))
#+end_src
** misc
#+begin_src emacs-lisp
(defun my-save-quit-window ()
  (interactive)
  (my-just-save-buffer-quiet)
  (quit-window))

(defun my-show-racket-commands ()
  (interactive)
  (counsel-M-x "^racket-"))

(defun my-show-racket-repl-commands ()
  (interactive)
  (counsel-M-x "^racket-repl"))

(defun my-evil-substitute ()
  (interactive)
  (evil-ex "%s/"))

(defun my-find-scratch ()
  (interactive)
  (switch-to-buffer "*scratch*"))

(defun my-snippet-kill-buffers ()
  "Kill all `snippet-mode' buffers."
  (interactive)
  (dolist (buffer (buffer-list))
    (when (eq (buffer-local-value 'major-mode buffer) 'snippet-mode)
      (kill-buffer buffer)
      (message "snippet buffers killed"))))

(defun my-org-toggle-emphasis ()
  (interactive)
  (if org-hide-emphasis-markers
      (progn
        (setq org-hide-emphasis-markers nil)
        (message "emphasis not hidden")
        (org-mode)
        (org-hide-drawer-all))
    (setq org-hide-emphasis-markers t)
    (org-mode)
    (org-hide-drawer-all)
    (message "emphasis hidden")))

(defun my-org-start-pomodoro ()
  (interactive)
  (org-todo "STRT")
  (org-pomodoro))

(defun my-move-file-to-trash ()
  "Go to config.org"
  (interactive)
  (move-file-to-trash (buffer-file-name))
  (kill-this-buffer))

(defun my-find-config.org ()
  "Go to config.org"
  (interactive)
  (find-file "~/.doom.d/config.org"))

(defun my-find-config.el ()
  "Go to config.el"
  (interactive)
  (find-file "~/.doom.d/config.el"))

(defun my-org-edit-special ()
  (interactive)
  (my-tangle-py-config-quiet)
  (org-edit-special)
  (my-recenter-window))

(defun my-org-edit-src-exit ()
  (interactive)
  (my-eval-buffer-quiet)
  (org-edit-src-exit)
  (my-tangle-py-config-quiet)
  (my-recenter-window))

(defun my-org-edit-src-exit-no-eval ()
  (interactive)
  (org-edit-src-exit)
  (my-tangle-py-config-quiet)
  (my-recenter-window))

(defun my-evaluate-next-sexp ()
  (interactive)
  (lispy-forward 1)
  (eros-eval-last-sexp nil))

(defun my-switch-to-scratch ()
  (interactive)
  (switch-to-buffer "~/.doom.d/tmp/sct.el*"))

(defun my-delete-frame ()
  (interactive)
  (delete-frame))

(defun my-save-buffer ()
  (interactive)
  (let ((inhibit-message t))
    (evil-ex-nohighlight)
    (save-buffer)))

(defun my-just-save-buffer-quiet ()
  (interactive)
  (let ((inhibit-message t))
    (save-buffer)))

(defun my-force-normal-state ()
  (interactive)
  (evil-ex-nohighlight)
  (evil-force-normal-state))

(defun my-eval-buffer ()
  (interactive)
  (my-save-buffer)
  (eval-buffer)
  (message " buffer evaluated"))

(defun my-eval-buffer-quiet ()
  (interactive)
  (let ((inhibit-message t))
    (save-buffer)
    (eval-buffer)))

(defun my-sel-to-end ()
  (interactive)
  (evil-visual-char)
  (evil-last-non-blank))

(defun my-yank-dirname-as-kill ()
  " based on <+default/yank-buffer-filename>"
  (interactive)
  (message (kill-new (abbreviate-file-name default-directory))))

(defun xah-clean-empty-lines ()
  "replace repeated blank lines to just 1."
  (interactive)
  (let ($begin $end)
    (if (region-active-p)
        (setq $begin (region-beginning) $end (region-end))
      (setq $begin (point-min) $end (point-max)))
    (save-excursion
      (save-restriction
        (narrow-to-region $begin $end)
        (progn
          (goto-char (point-min))
          (while (re-search-forward "\n\n\n+" nil "move")
            (replace-match "\n\n")))))))

(defun my-rename-file-and-buffer ()
  "Rename the current buffer and file it is visiting.
   Source: https://bit.ly/31X6KWk."
  (interactive)
  (let ((filename (buffer-file-name)))
    (if (not (and filename (file-exists-p filename)))
        (message "Buffer is not visiting a file!")
      (let ((new-name (read-file-name "New name: " filename)))
        (cond
         ((vc-backend filename) (vc-rename-file filename new-name))
         (t
          (rename-file filename new-name t)
          (set-visited-file-name new-name t t)))))))

;; Get focus even with focus stealing prevention
;; Source: https://bit.ly/37XClem
(defun my-new-frame-settings ()
  (select-frame-set-input-focus (selected-frame))
  (toggle-frame-maximized))

(defun my-show-server-name ()
  (interactive)
  (helpful-variable 'server-name))

(defun my-show-major-mode ()
  (interactive)
  (helpful-variable 'major-mode))

;;;;; MODES ;;;;;
(define-derived-mode my-lisp-interaction-mode
  lisp-interaction-mode "my-lim")

(define-derived-mode my-emacs-lisp-mode
  emacs-lisp-mode "my-el")

(define-derived-mode scratch-mode
  text-mode "my-scratch")

(define-derived-mode my-markdown-mode
  markdown-mode "my-md")

(define-derived-mode my-fundamental-mode
  markdown-mode "my-fund")

(define-derived-mode my-text-mode
  markdown-mode "my-txt")

(define-derived-mode my-org-mode
  org-mode "my-org")

(defun my-bash-shebang ()
  (interactive)
  (erase-buffer)
  (insert "#!/usr/bin/env bash\n\n\n\n\n\n\n\n\n\n\n")
  (sh-mode)
  (sh-set-shell "bash")
  (xah-clean-empty-lines)
  (forward-to-indentation)
  (evil-insert-state))

(defun my-python-shebang ()
  (interactive)
  (kill-region (point-min) (point-max))
  (insert "#!/usr/bin/env python3\n\n")
  ;; (insert "\"\"\" Docstring \"\"\"")
  ;; (insert "\n\n")
  (evil-insert-state))

(defun my-find-elisp-eintr ()
  (interactive)
  (find-file-other-window "~/Documents/study/eintr.el"))

(defun my-find-elisp-tmp ()
  (interactive)
  (find-file "~/.doom.d/tmp/tmp.el"))

(defun my-find-elisp-tmp-other-window ()
  (interactive)
  (find-file-other-window "~/.doom.d/tmp/tmp.el"))

(defun my-edit-hosts ()
  (interactive)
  (doom/sudo-find-file "/etc/hosts"))

(fset 'my-org-capture-todo-macro
      (kmacro-lambda-form [?\M-x ?c ?o ?u ?n ?s return ?T ?o ?d ?o return escape ?\M-k ?\M-j ?i ? ] 0 "%d"))

(defun my-emacs-init-commands ()
  (interactive)
  (start-process-shell-command "init commands" nil "~/dotfiles/maps/scripts/k")
  (toggle-frame-maximized))

(defun my-tangle-py-config ()
  (interactive)
  (my-just-save-buffer-quiet)
  (start-process-shell-command "tangle config.org"
                               nil
                               "~/dotfiles/maps/scripts/emacs-tangle-init")
  (message " init tangled"))

(defun my-tangle-py-config-quiet ()
  (interactive)
  (start-process-shell-command "tangle config.org"
                               nil
                               "~/dotfiles/maps/scripts/emacs-tangle-init"))
(defun my-recenter-window ()
  (interactive)
  (recenter-top-bottom
   `(4)))
#+end_src
* keybindings
** translations
#+begin_src emacs-lisp
(define-key key-translation-map (kbd "<pause>") (kbd "C-x"))
(define-key key-translation-map (kbd "<menu>") (kbd "C-c"))
#+end_src
