packages.el
;; (package! cycle-buffer
;;   :recipe (:local-repo "/home/jones/.doom.d/lisp/cycle-buffer"))
;; (package! targets
;;   :recipe (:local-repo "/home/jones/.doom.d/lisp/targets"))
(package! typo)
(package! delight)
(package! olivetti)
(package! eyebrowse)
(package! caps-lock)
(package! super-save)
(package! engine-mode)
(package! hl-sentence)
(package! better-jumper)
(package! google-translate)
(package! electric-operator)
(package! git-auto-commit-mode)
(package! evil-better-visual-line)
(package! aggressive-fill-paragraph)
(package! yasnippet-snippets)
(package! company-prescient)

(package! lorem-ipsum :disable t)
(package! org-web-tools :disable t)
(package! clipmon :disable t)
(package! elmacro :disable t)
(package! pabbrev :disable t)
(package! evil-lion :disable t)
(package! poet-theme :disable t)
(package! evil-snipe :disable t)
(package! kaolin-themes :disable t)
(package! dracula-theme :disable t)
(package! badwolf-theme :disable t)
(package! fountain-mode :disable t)
(package! url-shortener :disable t)
